user> (defn f1 [a b]
        #{1 1 a})
IllegalArgumentException Duplicate key: 1 

user> (defn f1 [a b]
        #{1 a a})
IllegalArgumentException Duplicate key: a  

user> (defn f1 [a b]
        #{1 (inc a) (inc a)})
IllegalArgumentException Duplicate key: (inc a)  

user> (defn f1 [a b]
        #{1 @a @a}) ;; notice that at run-time `@a` could easily produce different vals. But the reader sees equal forms.
IllegalArgumentException Duplicate key: (clojure.core/deref a)  

user> (defn f1 [a b]
        #{1 (+ a b) (+ a b)})
IllegalArgumentException Duplicate key: (+ a b)  
